000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ПоставщикиСлужбойДоставки/ПоставщикиСлужбойДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоставщикиСлужбойДоставки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресСлужбыДоставки</name>
    <type>
      <types>CatalogRef.АдресаСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоСлужбыДоставки</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.ГородаДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.Отделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаИзОтделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ПоставщикиСлужбойДоставки/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтображениеЭлементов()
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтправкаИзОтделенияПриИзменении(Элемент)
	
	ОтображениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура АдресСлужбыДоставкиПриИзменении(Элемент)
	АдресСлужбыДоставкиПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтображениеЭлементов()
	
	Элементы.ОтправкаНаАдрес.Видимость = Не Объект.ОтправкаИзОтделения;
	Элементы.ОтправкаНаОтделение.Видимость = Объект.ОтправкаИзОтделения;
	Элементы.Город.ТолькоПросмотр = Не Объект.ОтправкаИзОтделения;
	
КонецПроцедуры

&НаСервере
Процедура АдресСлужбыДоставкиПриИзмененииНаСервере()
	
	Объект.Город = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.АдресСлужбыДоставки, "ИДГорода");

КонецПроцедуры

#КонецОбласти
